from datetime import datetime

loc_list = {
    '安庆':[115.779, 117.224, 29.792, 31.262], # 安庆
    '北京':[115.814, 116.816, 39.637, 40.423], # 北京
    '重庆':[105.782, 108.345, 28.999, 30.147], # 重庆
    '鄂尔多斯':[106.639, 111.340, 37.738, 40.781], # 鄂尔多斯
    '福州':[118.434, 119.910, 25.361, 26.588], # 福州
    '广州':[113.022, 114.022, 22.529, 23.915], # 广州
    '济南':[116.206, 117.942, 36.019, 37.507], # 济南
    '南宁':[107.337, 109.605, 22.228, 24.031], # 南宁
    '三亚':[108.931, 109.808, 18.141, 18.620], # 三亚
    '沈阳':[122.474, 123.761, 41.234, 43.018], # 沈阳
    '太原':[111.531, 113.137, 37.475, 38.408], # 太原
    '唐山':[117.903, 118.825, 39.185, 40.131], # 唐山
    '天津':[116.919, 117.831, 38.695, 39.525], # 天津
    '无锡':[119.534, 120.597, 31.108, 31.997], # 无锡
    '武汉':[113.732, 115.053, 30.001, 31.325], # 武汉
    '雄安':[113.947, 116.238, 38.291, 39.582], # 雄安（保定市范围）
    '郑州':[112.751, 114.188, 34.276, 34.974], # 郑州
    '珠海':[113.091, 113.666, 21.870, 22.440], # 珠海
    '株洲':[112.975, 114.115, 26.038, 28.021], # 株洲
    '全国':[83.353, 126.196, 21.928, 47.096], # 全国（整体范围，固定放最后）
}
#根据测试需求切换默认值

minLng_global, maxLng_global, minLat_global, maxLat_global = loc_list['重庆']
startTime_global = int(datetime(2026,5,5,0,0,0).timestamp()) * 1000
endTime_global = int(datetime(2026,6,5,23,59,59).timestamp()) * 1000

# minLng_global, maxLng_global, minLat_global, maxLat_global = loc_list['全国']
# startTime_global = int(datetime(2026,5,5,0,0,0).timestamp()) * 1000
# endTime_global = int(datetime(2026,8,19,23,59,59).timestamp()) * 1000
